gwyghy/wireless/WirelessModule/WirelessModule_GD32F1x0__boot/WirelessModule_APP/Project/rfid_cc1101.c
/*********************************************************************************************************************************
** 文件名:  rfid_cc1101.h
** 描　述:  RFID驱动模块实现文件
** 		
**			RFID模块中使用的一些技术参数说明：
**
** 				Chipcon
** 				Product = CC1101
** 				Chip version = A   (VERSION = 0x04)
**				Crystal accuracy = 10 ppm
** 				X-tal frequency = 26 MHz
** 				RF output power = 0 dBm
** 				RX filterbandwidth = 541.666667 kHz
** 				Deviation = 127 kHz
** 				Data rate = 250 kBaud or 38.4K(Only two)
** 				Modulation = 2-FSK
** 				Manchester enable = (0) Manchester disabled
** 				RF Frequency = 432.999817 MHz
** 				Channel spacing = 199.951172 kHz
** 				Channel number = 0
** 				Optimization = Sensitivity
** 				Sync mode = (3) 30/32 sync word bits detected
** 				Format of RX/TX data = (0) Normal mode, use FIFOs for RX and TX
** 				CRC operation = (1) CRC calculation in TX and CRC check in RX enabled
** 				Forward Error Correction = (0) FEC disabled
** 				Length configuration = (1) Variable length packets, packet length configured by the first received byte after sync word.
** 				Packetlength = 255
** 				Preamble count = (2)  4 bytes
** 				Append status = 1
** 				Address check = (0) No address check
** 				FIFO autoflush = 0
** 				Device address = 0
** 				GDO0 signal selection = ( 6) Asserts when sync word has been sent / received, and de-asserts at the end of the packet
** 				GDO2 signal selection = (41) CHIP_RDY
**
** 创建人: 	沈万江
** 日　期:  2014-12-26
** 修改人:	
** 日　期:	
**
** 版　本:	V1.0.0.0
** 更新记录:
** 更新记录	：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
**--------------------------------------------------------------------------
**************************Copyright (c) 1998-1999 天津华宁电子技术有限公司技术开发部*************************************************/

#include "rfid_cc1101.h"
#include "rfid_driver.h"
#include "systick.h"
#include "usart.h"
#include "gd32f1x0_gpio.h"
#if WL_SPI_TYPE > 0	//电液控2.0有RFID

 uint32_t vu32GDO2IntFlag = 0;	// GDO上升沿触发标志，代表一包数据接收校验正确
 uint32_t vu32GDO0IntFlag = 0;	// GDO下降沿触发标志，代表一包数据发送完成
const uint8_t uc8Patabel[8] = {0xC0 ,0xC0 ,0xC0 ,0xC0 ,0xC0 ,0xC0 ,0xC0 ,0xC0};
#if 1
/*const*/ Tag_RF_CONFIG st_RfConfig = {
    0x0C,	//0x06,   // FSCTRL1   	频率合成器控制 1
    0x00,   // FSCTRL0   	频率合成器控制 0
    0x10,   // FREQ2     	频率控制字, 高字节
    0xA7,   // FREQ1     	频率控制字, 次高字节
    0x62,   // FREQ0     	频率控制字, 低字节

    0x2D,   // MDMCFG4   	调制配置
    0x3B,   // MDMCFG3   	调制配置
    0x03,   // MDMCFG2   	调制解调器配置
			// 				bit7 = 0,在解调之前不关闭数字直流滤波模块
			//				bit6-4 = 0,使用2-FSK调制格式
			//				bit3 = 0,失能曼切斯特编解码
			//				bit2-0 = 3,30/32同步字位检测
    0x22,   // MDMCFG1   	调制解调器配置
			//				bit7 = 0,失能前纠错码，只对固定数据长度适用
			//				bit6-4 = 010,序列字节个数为4
			//				bit1-0 = 10，通道空间的2位幂
    0xF8,   // MDMCFG0   	调制配置

    0x00,   // CHANNR    	通道号
    0x62,   // DEVIATN   	调制解调器偏差设置 (when FSK modulation is enabled).
    0xB6,   // FREND1    	前端RX 配置
    0x10,   // FREND0    	前端TX 配置
    0x18,   // MCSM0     	CC1101无线主控制逻辑状态配置

    0x1D,   // FOCCFG    	频率偏移补偿配置
    0x1C,   // BSCFG     	位同步配置
    0xC7,   // AGCCTRL2  	AGC 控制
    0x00,   // AGCCTRL1  	AGC 控制
    0xB0,   // AGCCTRL0  	AGC 控制

    0xEA,   // FSCAL3    	频率合成器校准
    0x2A,   // FSCAL2    	频率合成器校准
    0x00,   // FSCAL1    	频率合成器校准
    0x1F,   // FSCAL0    	频率合成器校准
    0x59,   // FSTEST    	频率合成器校准

    0x88,   // TEST2     	不同测试设置
    0x31,   // TEST1     	不同测试设置
    0x09,   // TEST0     	不同测试设置
    0x07,   // IOCFG2    	GDO2 输入管脚配置，用于数据接收，当接收的数据校验正确给MCU一个外部中断信号
    0x06,   // IOCFG0    	GDO0 输入管脚配置，用于数据发送，当发送完成后产生中断信号 
#if (CC1101_ADDR_FILTER > 0)
    0x0E,   // PKTCTRL1  	数据包自动控制寄存器1，0x00001100,
			//				bit3 = 1,CRC校验不正确自动冲刷RX FIFO功能失能
			//				bit2 = 1,数据后面再附加两个状态字节
			//				bit1-0 = 00，无地址检查； =10,地址检查，00为广播地址；
#else
	0x0C,
#endif
    0x45,   // PKTCTRL0  	数据包自动控制寄存器0，0x01000101，
			// 				bit6 = 1，数据加密开启；
			// 				bit5-4 = 00，正常数据收发模式；
			// 				bit2 = 1，CRC使能；
			// 				bit1-0 = 01，可变数据包长度模式,length 在sync后边第 1 个字节；
			
    0xFE,	//0x55,   // ADDR      	器件地址，默认0x00
    0x40,	//0x0E,   // PKTLEN    	数据包长度，length = 61;
};
#endif
#if 0
/*const*/ Tag_RF_CONFIG st_RfConfig = {
    0x0C,   // FSCTRL1   	频率合成器控制 1
    0x00,   // FSCTRL0   	频率合成器控制 0
    0x10,   // FREQ2     	频率控制字, 高字节
    0xA7,   // FREQ1     	频率控制字, 次高字节
    0x62,   // FREQ0     	频率控制字, 低字节

    0x2D,   // MDMCFG4   	调制配置
    0x3B,   // MDMCFG3   	调制配置
    0x03,   // MDMCFG2   	调制解调器配置
			// 				bit7 = 0,在解调之前不关闭数字直流滤波模块
			//				bit6-4 = 0,使用2-FSK调制格式
			//				bit3 = 0,失能曼切斯特编解码
			//				bit2-0 = 3,30/32同步字位检测
    0x22,   // MDMCFG1   	调制解调器配置
			//				bit7 = 0,失能前纠错码，只对固定数据长度适用
			//				bit6-4 = 010,序列字节个数为4
			//				bit1-0 = 10，通道空间的2位幂
    0xF8,   // MDMCFG0   	调制配置

    0x00,   // CHANNR    	通道号
    0x62,   // DEVIATN   	调制解调器偏差设置 (when FSK modulation is enabled).
    0x56,   // FREND1    	前端RX 配置
    0x10,   // FREND0    	前端TX 配置
    0x18,   // MCSM0     	CC1101无线主控制逻辑状态配置

    0x1D,   // FOCCFG    	频率偏移补偿配置
    0x1C,   // BSCFG     	位同步配置
    0xC7,   // AGCCTRL2  	AGC 控制
    0x00,   // AGCCTRL1  	AGC 控制
    0xB0,   // AGCCTRL0  	AGC 控制

    0xEA,   // FSCAL3    	频率合成器校准
    0x2A,   // FSCAL2    	频率合成器校准
    0x00,   // FSCAL1    	频率合成器校准
    0x1F,   // FSCAL0    	频率合成器校准
    0x59,   // FSTEST    	频率合成器校准

    0x88,   // TEST2     	不同测试设置
    0x31,   // TEST1     	不同测试设置
    0x09,   // TEST0     	不同测试设置
    0x07,   // IOCFG2    	GDO2 输入管脚配置，用于数据接收，当接收的数据校验正确给MCU一个外部中断信号
    0x06,   // IOCFG0    	GDO0 输入管脚配置，用于数据发送，当发送完成后产生中断信号 
#if (CC1101_ADDR_FILTER > 0)
    0x0E,   // PKTCTRL1  	数据包自动控制寄存器1，0x00001100,
			//				bit3 = 0,CRC校验不正确自动冲刷RX FIFO功能使能
			//				bit2 = 1,数据后面再附加两个状态字节
			//				bit1-0 = 00，无地址检查； =10,地址检查，00为广播地址；
#else
	0x0C,
#endif

#if (CC1101_PKTLEN_MODE > 0)
	0x44,
#else
    0x45,   // PKTCTRL0  	数据包自动控制寄存器0，0x01000101，
			// 				bit6 = 1，数据加密开启；
			// 				bit5-4 = 00，正常数据收发模式；
			// 				bit2 = 1，CRC使能；
			// 				bit1-0 = 01，可变数据包长度模式,length 在sync后边第 1 个字节；
#endif			
    0xFE,   // ADDR      	器件地址，默认0x00
    0x40,   // PKTLEN    	数据包长度，length = 61;
};
#endif
const uint8_t st_RfConfigIndex[]={
    CC1101_FSCTRL1,     // FSCTRL1   Frequency synthesizer control.
    CC1101_FSCTRL0,     // FSCTRL0   Frequency synthesizer control.
    CC1101_FREQ2,       // FREQ2     Frequency control word, high byte.
    CC1101_FREQ1,       // FREQ1     Frequency control word, middle byte.
    CC1101_FREQ0,       // FREQ0     Frequency control word, low byte.
 
    CC1101_MDMCFG4,     // MDMCFG4   Modem configuration.
    CC1101_MDMCFG3,     // MDMCFG3   Modem configuration.
    CC1101_MDMCFG2,     // MDMCFG2   Modem configuration.
    CC1101_MDMCFG1,     // MDMCFG1   Modem configuration.
    CC1101_MDMCFG0,     // MDMCFG0   Modem configuration.
 
    CC1101_CHANNR,      // CHANNR    Channel number.
    CC1101_DEVIATN,     // DEVIATN   Modem deviation setting (when FSK modulation is enabled).
    CC1101_FREND1,      // FREND1    Front end RX configuration.
    CC1101_FREND0,      // FREND0    Front end TX configuration.
    CC1101_MCSM0,       // MCSM0     Main Radio Control State Machine configuration.
 
    CC1101_FOCCFG,      // FOCCFG    Frequency Offset Compensation Configuration.
    CC1101_BSCFG,       // BSCFG     Bit synchronization Configuration.
    CC1101_AGCCTRL2,    // AGCCTRL2  AGC control.
    CC1101_AGCCTRL1,    // AGCCTRL1  AGC control.
    CC1101_AGCCTRL0,    // AGCCTRL0  AGC control.
 
    CC1101_FSCAL3,      // FSCAL3    Frequency synthesizer calibration.
    CC1101_FSCAL2,      // FSCAL2    Frequency synthesizer calibration.
    CC1101_FSCAL1,      // FSCAL1    Frequency synthesizer calibration.
    CC1101_FSCAL0,      // FSCAL0    Frequency synthesizer calibration.
    CC1101_FSTEST,      // FSTEST    Frequency synthesizer calibration.
 
    CC1101_TEST2,       // TEST2     Various test settings.
    CC1101_TEST1,       // TEST1     Various test settings.
    CC1101_TEST0,       // TEST0     Various test settings.
    CC1101_IOCFG2,      // IOCFG2    GDO2 output pin configuration.
    CC1101_IOCFG0,      // IOCFG0    GDO0 output pin configuration.
 
    CC1101_PKTCTRL1,    // PKTCTRL1  Packet automation control.
    CC1101_PKTCTRL0,    // PKTCTRL0  Packet automation control.
    CC1101_ADDR,        // ADDR      Device address.
    CC1101_PKTLEN,      // PKTLEN    Packet length.
};
