gwyghy/wireless/WirelessModule/WirelessModule_GD32F1x0__boot/WirelessModule_APP/Project/rfid_cc1101.c
//----------------------------------------------------------------------------------------
// 		数组常量声明
//----------------------------------------------------------------------------------------
/*
 * Optimum PATABLE Settings for Various Output Power Levels
 */
const uint8_t s_u8RFOutputPowerCfgTab[8] =
{
/*  PATABLE Setings     Output Power    comment*/
    0x12,               //-30dBm
    0x0E,               //-20dBm
    0x1D,               //-15dBm
    0x34,               //-10dBm
    0x60,               //0dBm
    0x84,               //+5dBm
    0xC8,               //+7dBm
    0xC0,               //+10dBm
};
/*
 * FIFOTHR.CLOSE_IN_RX - RX Attenuation, Typical Values
 */
static const uint8_t s_u8RFAttenuationCfgTab[4] =
{
/*  FIFOTHR Setings     	CLOSE_IN_RX     RX Attenuation*/
    0x07,                	// 0(00)         	0dB
    0x17,               	// 1(01)         	6dB
    0x27,               	// 2(10)         	12dB
    0x37                	// 3(11)         	18dB        
};
/* 
 * FIFOTHR.ADC_RETENTION - RX FIFO 和 TX FIFO 阈值
 */
static const uint8_t s_u8RFCReg_FIFOTHR_BIT6[2] = 
{
    0x00,       			//250KBaud
    0x40        			//38.4KBaud
};
const uint8_t s_u8RFCReg_MCSM2[2] = 
{
    0x06,       			//250KBaud
    0x04       				//38.4KBaud
};
//Data Rate 寄存器配置
/* 
 * MDMCFG4 - Modem Configuration: Sets the decimation ratio for 
 * the delta-sigma ADC input stream and thus the channel bandwidth. 
 */
const uint8_t s_u8RFCReg_MDMCFG4[2] = 
{
    0x2D,       //250KBaud
    0xCA        //38.4KBaud
};
/* MDMCFG3 - Modem Configuration: The mantissa of the user specified symbol rate.*/
const uint8_t s_u8RFCReg_MDMCFG3[2] = 
{
    0x3B,       //250KBaud
    0x83        //38.4KBaud
};
/* FSCAL3 - Frequency Synthesizer Calibration */
const uint8_t s_u8RFCReg_FSCAL3[2] = 
{
    0xEA,       //250KBaud
    0xE9        //38.4KBaud
};

/* TEST2 - Various Test Settings */
const uint8_t s_u8RFCReg_TEST2[2] = 
{
    0x88,       //250KBaud
    0x81        //38.4KBaud
};
/* TEST1 - Various Test Settings */
const uint8_t s_u8RFCReg_TEST1[2] = 
{
    0x31,       //250KBaud
    0x35        //38.4KBaud
};
/* DEVIATN - Modem Deviation Setting */
const uint8_t s_u8RFCReg_DEVIATN[2] = 
{
    0x62,       //250KBaud
    0x34        //38.4KBaud
};
uint8_t g_u8RFVelocityIdx = 1;		//38.4kbps	//0;	//250kbps
uint16_t g_u16RunningMode = OBUMODE_ONROAD;

Tag_RFChipPar st_RFChipPar = 
{
	DEFAULT_RF_PWRIDX, 
	DEFAULT_RF_ATNIDX, 
	DEFAULT_RF_VELOCITY, 
	DEFAULT_RES_INTERVAL_TIME, 
	DEFAULT_SLOT_TIME, 
	DEFAULT_SLOT_SND_NUM
};
void RfidConfig(/*const*/ Tag_RF_CONFIG* ptRfConfig, const uint8_t u8RfPaTable);

uint8_t u8RcvLength = 64;										// 用于存储从CC1101的RX FIFO中接收的数据的长度
uint8_t u8RcvData[CC1101_RX_FIFO_SIZE+8];						// 用于存储从CC1101的RX FIFO中接收的一包数据
#define RFID_RCV_FRM_SIZE			10						// 存储池长度
st_RFIDRcvFrame st_RFIDRcvFrmPool[RFID_RCV_FRM_SIZE];		// RFID接收数据存储池
uint32_t u32RcvFrmPoolWritePtr = 0;
uint32_t u32RcvFrmPoolReadPtr = 0;
uint32_t u32RcvFrmPoolCnt = 0;

 uint32_t vu32CC1100State;										// 1=CC1100处于发送状态
RCVED_BACK_CALL_FUNC RcvedBackCallFunc=NULL;				// 接收后应用层实现的回调函数



/***********************************************************************************************
** 函 数 名：	RFID_HarewreInit()
** 功能描述：	
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void RFID_HarewreInit(void)
{
//	uint16_t i = 0;
//	HAL_NVIC_DisableIRQ(RFID_GDO0_EXTI_IRQn);
//	__HAL_GPIO_EXTI_CLEAR_IT(RFID_SPI_MCU_GDO0_PIN);
//	__HAL_GPIO_EXTI_CLEAR_IT(RFID_SPI_MCU_GDO0_PIN);
//	__HAL_GPIO_EXTI_CLEAR_FLAG(RFID_SPI_MCU_GDO0_PIN);
//	__HAL_GPIO_EXTI_CLEAR_FLAG(RFID_SPI_MCU_GDO0_PIN);
//	HAL_NVIC_ClearPendingIRQ(RFID_GDO0_EXTI_IRQn);
//	HAL_NVIC_ClearPendingIRQ(RFID_GDO2_EXTI_IRQn);
//#if OS_CRITICAL_METHOD == 3u
//    OS_CPU_SR  cpu_sr = 0u;
//#endif	
//	OS_ENTER_CRITICAL();							//禁止全局中断
	RfidChipReset();
	delay_1us(10);
    /*
	 * 芯片配置
	 */ 	 
	RfidConfig(&st_RfConfig,s_u8RFOutputPowerCfgTab[st_RFChipPar.u8RFPwrIdx]);
//	OS_EXIT_CRITICAL();								//回复全局中断
//	delay_1us(10);
	
	/*
	 * Additional chip configuration
	 */ 
	#if (DEFAULT_CCA_USE_FLAG == CC1101_CCA_ENABLED)
		RfidWriteReg(CC1101_MCSM1, 0x3F); //Use CCA, RX after TX and RX
		//RfidWriteReg(CC1101_MCSM1, 0x0C); // No CCA, IDLE after TX and RX			
	#else	
		RfidWriteReg(CC1101_MCSM1, 0x0F); // No CCA, RX after TX and RX
	#endif	
	//RfidWriteReg(CC1101_MCSM1, 0x30); // CCA enabled, IDLE after TX and RX
	RfidWriteReg(CC1101_SYNC0, 0x33); // SYNC0
	RfidWriteReg(CC1101_SYNC1, 0x33); // SYNC
	RfidWriteReg(CC1101_IOCFG0,0x06);
	RfidWriteReg(CC1101_IOCFG2,0x07);
}
/***********************************************************************************************
** 函 数 名：	WaitGPIOReset
** 功能描述：	等待指定GPIO引脚Reset信号
** 输　  入：	port: GPIO PORT
**         ：	pin: GPIO PIN
** 输　  出：	FALSE=等待超时
************************************************************************************************/
uint32_t WaitGPIOReset(uint32_t Portx, uint32_t Pin)
{
	uint32_t i;
 	for (i = 0; i < 20000; i++)
	{
		if (gpio_output_bit_get(Portx, Pin) == RESET)
		{
			return (TRUE);
		}
	}
	return (FALSE);
}
/***********************************************************************************************
** 函 数 名：	RfidRxRegInit
** 功能描述：	设置CC1101寄存器为RX模式
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void RfidRxRegInit(void)
{
    uint8_t u8FifoThr = s_u8RFAttenuationCfgTab[st_RFChipPar.u8RFAtnIdx] + s_u8RFCReg_FIFOTHR_BIT6[g_u8RFVelocityIdx];
    delay_1us(10);	
	RfidWriteReg(CC1101_FIFOTHR, u8FifoThr);
   delay_1us(10);
	//RfidWriteReg(CC1101_FIFOTHR, s_aucRFAttenuationCfgTab[s_tRFChipPar.ucRFAtnIdx]);  
	RfidWriteReg(CC1101_AGCCTRL2, 0xC7);
   delay_1us(10);
	RfidWriteReg(CC1101_AGCCTRL1, 0x00);
   delay_1us(10);
	RfidWriteReg(CC1101_MCSM0, 0x18);
  delay_1us(10);
	RfidWriteReg(CC1101_WORCTRL, 0xF8);
  delay_1us(10);	
	RfidWriteReg(CC1101_MCSM2, 0x07);
  delay_1us(10);
}
/***********************************************************************************************
** 函 数 名：	RfidWORRegInit
** 功能描述：	设置CC1101寄存器为RX模式对应配置
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void RfidWORRegInit(void)
{
	uint8_t u8MCSM2;
	
#define WOR_1200_MS
    uint8_t u8FifoThr = s_u8RFAttenuationCfgTab[st_RFChipPar.u8RFAtnIdx] + s_u8RFCReg_FIFOTHR_BIT6[g_u8RFVelocityIdx];
    RfidWriteReg(CC1101_FIFOTHR, u8FifoThr);
   delay_1us(10);
	//RfidWriteReg(CC1101_FIFOTHR, s_aucRFAttenuationCfgTab[s_tRFChipPar.ucRFAtnIdx] );
    RfidWriteReg(CC1101_AGCCTRL2, 0x03);
   delay_1us(10);
	RfidWriteReg(CC1101_AGCCTRL1, 0x40);
   delay_1us(10);
	RfidWriteReg(CC1101_MCSM0, 0x30);
    //RfidWriteReg(CC1101_MCSM0, 0x10);
   delay_1us(10);
	RfidWriteReg(CC1101_WORCTRL, 0x18);
   delay_1us(10);
	u8MCSM2 = s_u8RFCReg_MCSM2[g_u8RFVelocityIdx];
   
	RfidWriteReg(CC1101_MCSM2, u8MCSM2);//0x16
#ifdef WOR_1200_MS
  delay_1us(10);
   RfidWriteReg(CC1101_WOREVT1, 0xA2);
  delay_1us(10); 
  RfidWriteReg(CC1101_WOREVT0, 0x80);
  delay_1us(10);
#else
    RfidWriteReg(CC1101_WOREVT1, 0x87);
    RfidWriteReg(CC1101_WOREVT0, 0x6B);
#endif
}

/***********************************************************************************************
** 函 数 名：	RfidConfig()
** 功能描述：	CC1101参数配置
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void RfidConfig(/*const*/ Tag_RF_CONFIG* ptRfConfig, const uint8_t u8RfPaTable)
{
	uint8_t u8Idx = 0;
    /*const*/ uint8_t *pu8RfConfig = (/*const*/ uint8_t *)ptRfConfig;

    switch (st_RFChipPar.u8RFVelocity)
    {
      case 38:/*38.4k*/
      {
		g_u8RFVelocityIdx = 1;
        break;
      }
      default:
        break;     
    }

    if (g_u8RFVelocityIdx) /*非250k需要修改寄存器*/
    {
        *(pu8RfConfig + 5) = s_u8RFCReg_MDMCFG4[g_u8RFVelocityIdx]; /*MDMCFG4*/
        *(pu8RfConfig + 6) = s_u8RFCReg_MDMCFG3[g_u8RFVelocityIdx]; /*MDMCFG3*/
        *(pu8RfConfig + 11) = s_u8RFCReg_DEVIATN[g_u8RFVelocityIdx]; /*DEVIATN*/
        *(pu8RfConfig + 20) = s_u8RFCReg_FSCAL3[g_u8RFVelocityIdx];/*FSCAL3*/
        *(pu8RfConfig + 25) = s_u8RFCReg_TEST2[g_u8RFVelocityIdx];/*TEST2*/
        *(pu8RfConfig + 26) = s_u8RFCReg_TEST1[g_u8RFVelocityIdx];/*TEST1*/
    }
    
    for(u8Idx = 0; u8Idx < 34; u8Idx++)
    {
        RfidWriteReg(st_RfConfigIndex[u8Idx],  pu8RfConfig[u8Idx]);
    }
    RfidWriteReg(CC1101_PATABLE | CC1101_WRITE_BURST, u8RfPaTable);
}
/***********************************************************************************************
** 函 数 名：	uint8_t B0itReverse(uint8_t byte)
** 功能描述：	输入一个字节，字节数据翻转，例如：输入01010101，输出10101010
** 输　  入：	字节
** 输　  出：	字节数据翻转
** 作　  者：	程海超
** 日　  期：	2016.7.12
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
#if	WL_SPI_TYPE == 2	//=1：本地集成无线红外（SPI接口）
uint8_t BitReverse(uint8_t byte)
{
	byte = (byte & 0xaa) >> 1 | (byte & 0x55) << 1;
	byte = (byte & 0xcc) >> 2 | (byte & 0x33) << 2;
	byte = (byte & 0xf0) >> 4 | (byte & 0x0f) << 4;
	return byte;
}
#endif
/***********************************************************************************************
** 函 数 名：	DrvRfChipReset
** 功能描述：	
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void RfidChipReset(void)
{
//	uint8_t i;
    SpiResetChipSingle();
	delay_1us(10);
	RfidStrobe(CC1101_SRES);
	delay_1us(10);
}
/***********************************************************************************************
** 函 数 名：	DrvSpiResetChipSingle
** 功能描述：	
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint32_t SpiResetChipSingle(void)
{
    /* 芯片片选信号 */
	RFID_MCU_SCK_SET;
	RFID_MCU_SI_RESET;
    RFID_MCU_CS_DEASSERT;
    delay_1us(30);
    RFID_MCU_CS_ASSERT;
    delay_1us(100);
    RFID_MCU_CS_DEASSERT;
    delay_1us(45);
    return RET_OK;
}


/*!
    \brief      use spi bus write a byte to sd card
    \param[in]  data: data to write
    \param[out] none
    \retval     the data read from the SPI bus
*/
uint8_t spi_write(uint8_t data)
{
	uint8_t value = 0;
    while(RESET == spi_i2s_flag_get(SPI0,SPI_FLAG_TBE));
    /* send the data */
    spi_i2s_data_transmit(SPI0, data);
    while(RESET == spi_i2s_flag_get(SPI0,SPI_FLAG_RBNE));
    /* return the data read from the SPI bus */ 
    value =  spi_i2s_data_receive(SPI0);
	return value;
}

///*!
//    \brief      use spi bus read a byte from sd card
//    \param[in]  none
//    \param[out] none
//    \retval     the data read from the SPI bus
//*/
//uint8_t spi_read(void)
//{
//    uint8_t value = 0;
//    while(RESET == spi_i2s_flag_get(SPI0,SPI_FLAG_TBE));
//    /* send the dummy byte to generate clock */
//    spi_i2s_data_transmit(SPI0, SD_DUMMY_BYTE);
//    while(RESET == spi_i2s_flag_get(SPI0,SPI_FLAG_RBNE));
//    /* get the data from the SPI bus */
//    value = spi_i2s_data_receive(SPI0);
//    /* return the data value*/
//    return value;
//}
/***********************************************************************************************
** 函 数 名：	DrvSpiResetChipSingle
** 功能描述：	
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
 uint8_t SpiMcuRead(uint8_t u8Addr, uint8_t* pu8Data, uint16_t u16Length)
{
	uint8_t buf;
	uint16_t u16Index;
    uint8_t u8Status;
#if OS_CRITICAL_METHOD == 3u
    OS_CPU_SR  cpu_sr = 0u;
#endif
    /*
     * SPI准备就绪
     */
	//RFID_SPI_MCU_BEGIN;
	RFID_MCU_CS_ASSERT;
	delay_1us(50);		//delay_1us(300);
	u8Status = RFID_SPI_MCU_WAIT_MISO;
	if (u8Status == FALSE)
		return(TIME_OVER);
//	OS_ENTER_CRITICAL();							//禁止全局中断
	spi_write(u8Addr);
//	OS_EXIT_CRITICAL();								//回复全局中断
	delay_1us(10);
    /*
     *  读数据
     */
	
	for (u16Index = 0; u16Index < u16Length; u16Index++)
    {

		buf = (uint8_t) spi_write(0);
		(pu8Data[u16Index]) = buf;
		delay_1us(10);
    }
	
