gwyghy/wireless/WirelessModule/WirelessModule_GD32F1x0__boot/WirelessModule_APP/Project/rfid_cc1101.c
    /*
     *  SPI读数据结束
     */
    RFID_SPI_MCU_END;
	delay_1us(10);
    /*
     *  返回读写是否成功状态
     */
    return(u8Status);
}
/***********************************************************************************************
** 函 数 名：	RfidReadStatusReg
** 功能描述：	
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 注意事项：	当通过SPI读取接口读取一个状态寄存器的时候，同时射频硬件也在更新寄存器，就会有一个很小
**				的，有限的可能导致结果不正确。CC1100和CC2500错误纠正中都说明了这一问题，且推荐了几种
**				合适的工作区
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RfidReadStatusReg(uint8_t u8Addr)
{
    uint8_t u8Reg;
	
    SpiMcuRead(u8Addr | CC1101_READ_BURST, &u8Reg, 1);
	
    return(u8Reg);
}
/***********************************************************************************************
** 函 数 名：	RfidSpiWrite
** 功能描述：	向CC1101写入数据
** 输　  入：	uint8_t u8Addr，写入的首地址
**				const uint8_t* pu8Data，写入数据的地址
**				uint16_t u16Length，写入数据长度	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RfidSpiWrite(uint8_t u8Addr, const uint8_t* pu8Data, uint16_t u16Length)
{
	uint8_t u8RetSta;
	
    u8RetSta = SpiMcuWrite(u8Addr, pu8Data, u16Length);

    return (u8RetSta);
}
/***********************************************************************************************
** 函 数 名：	SpiMcuWrite
** 功能描述：	向CC1101写入数据
** 输　  入：	uint8_t u8Addr，写入的首地址
**				const uint8_t* pu8Data，写入数据的地址
**				uint16_t u16Length，写入数据长度
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
 uint8_t SpiMcuWrite(uint8_t u8Addr, const uint8_t* pu8Data, uint16_t u16Length)
{
    uint16_t u16Index;
    uint8_t u8Status;
#if OS_CRITICAL_METHOD == 3u
    OS_CPU_SR  cpu_sr = 0u;
#endif
    //RFID_SPI_MCU_BEGIN;

	RFID_MCU_CS_ASSERT;
	delay_1us(50);
	u8Status = RFID_SPI_MCU_WAIT_MISO;
	if (u8Status == FALSE)
		return(TIME_OVER);
//	OS_ENTER_CRITICAL();							//禁止全局中断
	spi_write(u8Addr);
//	OS_EXIT_CRITICAL();		
	delay_1us(10);
//	OS_ENTER_CRITICAL();							//禁止全局中断
	
	for (u16Index = 0; u16Index < u16Length; u16Index++)
    {
		spi_write(pu8Data[u16Index]);
//		spi_write((pu8Data[u16Index]));
		delay_1us(10);
   }	
	RFID_SPI_MCU_END;
   delay_1us(10);
    return(u8Status);
}
/***********************************************************************************************
** 函 数 名：	RfidStrobe
** 功能描述：	向CC1101发送 strobe commands,返回状态
** 输　  入：	u8StrobeCmd，要发送的命令
** 输　  出：	u8Status, 返回状态信息
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RfidStrobe(uint8_t u8StrobeCmd)
{
	uint8_t u8Status;
	#if OS_CRITICAL_METHOD == 3                      /* Allocate storage for CPU status register           */
	OS_CPU_SR  cpu_sr = 0;
	#endif


    if (CC1101_STX == u8StrobeCmd)
		vu32CC1100State = 1;
	else if(CC1101_SRX == u8StrobeCmd)
		vu32CC1100State = 2;
	else
		vu32CC1100State = 0;
    //RFID_SPI_MCU_BEGIN;
	RFID_MCU_CS_ASSERT;
	delay_1us(50);		//delay_1us(300);
	u8Status = RFID_SPI_MCU_WAIT_MISO;
	if (u8Status == FALSE)
	{
		return(TIME_OVER);
	}

	spi_write(u8StrobeCmd);
	delay_1us(50);
//    u8Status = spi_i2s_data_receive(SPI0);

	RFID_SPI_MCU_END;
	delay_1us(10);
    return(u8Status);
}
/***********************************************************************************************
** 函 数 名：	RFID_SpiPortInit
** 功能描述：	
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void RfidReadAllStatusReg(uint8_t* pu8Data, uint16_t u16Length)
{
	uint8_t u8i;
	
	for(u8i = 0; u8i < u16Length; u8i++)
	{
		pu8Data[u8i] = RfidReadStatusReg(StatusRegBaseAddress + u8i);
		delay_1us(1);
	}
}
/***********************************************************************************************
** 函 数 名：	RfidWriteReg
** 功能描述：	向CC1101芯片写寄存器的值
** 输　  入：	uint8_t u8Addr，写入寄存器地址；
** 				uint8_t u8Data，写入数据；
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RfidWriteReg(uint8_t u8Addr, uint8_t u8Data)
{
    return(RfidSpiWrite(u8Addr, &u8Data, 1));
}
/***********************************************************************************************
** 函 数 名：	RfidWriteFifo
** 功能描述：	向TX-FIFO写入指定长度的数据
** 输　  入：	const uint8_t *pu8Data，写入数据要保存的地址；
** 				uint8_t u8Length，写入数据长度；
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RfidWriteFifo(const uint8_t *pu8Data, uint8_t u8Length)
{
    return(SpiMcuWrite(CC1101_TXFIFO | CC1101_WRITE_BURST, pu8Data, u8Length));
}
/***********************************************************************************************
** 函 数 名：	RfidReadFifo
** 功能描述：	从RX-FIFO读取指定长度的数据
** 输　  入：	uint8_t *pu8Data，读取数据要保存的地址；
** 				uint8_t u8Length，读取的数据长度；
** 输　  出：	返回状态信息
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RfidReadFifo(uint8_t *pu8Data, uint8_t u8Length)
{
    return(SpiMcuRead(CC1101_RXFIFO | CC1101_READ_BURST, pu8Data, u8Length));
}
/***********************************************************************************************
** 函 数 名：	RFCtrlSetIDLE
** 功能描述：	
** 输　  出：	返回状态信息
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RFCtrlSetIDLE(void)
{
    uint16_t u16TimeoutCnt = 0;
	
    uint8_t u8ChipStatus;
	
