gwyghy/wireless/WirelessModule/WirelessModule_GD32F1x0__boot/WirelessModule_APP/Project/rfid_cc1101.c
    /* 
	 * 保证发送接收命令之前是处于IDLE状态
	 */
    RfidStrobe(CC1101_SIDLE);
    do
    {
        u8ChipStatus = RfidReadStatusReg(CC1101_MARCSTATE);
        u16TimeoutCnt ++;        
        delay_1us(10);
        if(u16TimeoutCnt > MAX_STATUS_DELAY)
        {
            return(CHIP_STATUS_ABNORMAL);
        }
    }while(u8ChipStatus != CC1101_MARCSTATE_IDLE);
    return RET_OK;
}

/***********************************************************************************************
** 函 数 名：	SetRFChipIDLE
** 功能描述：	复位或直接设置射频芯片状态为IDLE
** 输　  入：	uint8_t u8ProcPreSet，预处理状态；
** 				uint8_t u8ClearUpMode，要清除的状态；
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t SetRFChipIdle(uint8_t u8ProcPreSet, uint8_t u8ClearUpMode)
{
    uint8_t u8RetVal = 0;
	
    /*
	 * 设置前复位RFChip或进入SIDLE
	 */
    if (RFCHIP_RESET_NECESSARILY == u8ProcPreSet)
    {
        RFID_Init();
		delay_1us(10);
        RfidStrobe(CC1101_SIDLE);/* 退出RX/TX，关掉频率分析仪 */
		delay_1us(10);
		RfidStrobe(CC1101_SCAL);
		delay_1us(10);
    }
    else
    {
        u8RetVal = RFCtrlSetIDLE();
        if(RET_OK != u8RetVal)
        {
             return CHIP_STATUS_ABNORMAL;
        }
    }
	
    if (RFCHIP_TX_CLEARUP == u8ClearUpMode)
    {
        RfidStrobe(CC1101_SFTX);    // 冲洗 TX FIFO buffer.
		//delay_1us(10);
    }
    else
    {
        RfidStrobe(CC1101_SFRX);    // 冲洗 RX FIFO buffer.
		//delay_1us(10);
    }
    
    return RET_OK;
}
/***********************************************************************************************
** 函 数 名：	RFTxSendPacket
** 功能描述：	向CC1101芯片写数据包
** 输　  入：	uint8_t* pu8Data，写入数据地址；
** 				uint8_t u8Length，写入数据长度；
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RFTxSendPacket(uint8_t* pu8Data, uint8_t u8Length)
{	
	// 	uint32_t u32i;
	//static uint8_t u8LastLen=0;
	uint32_t u32i = 0x00;
	#if (DEFAULT_CCA_USE_FLAG == CC1101_CCA_ENABLED)
		uint8_t u8ChipStatus = 0x00;
		uint16_t u16TimeoutCnt= 0x00;
	#endif
	#if (OS_CRITICAL_METHOD == 3)                      /* Allocate storage for CPU status register           */
		OS_CPU_SR  cpu_sr = 0;
	#endif

    if (u8Length >= CC1101_TX_FIFO_SIZE)
    {
        return (TX_LENGTH_ERR);
    }
    
//	OS_ENTER_CRITICAL();//关全局中断
    /* 保证发送接收命令之前是处于IDLE状态*/
    if(RET_OK != SetRFChipIdle(RFCHIP_IDLE_POSITIVE, RFCHIP_TX_CLEARUP))
    {
//		OS_EXIT_CRITICAL();//开全局中断
        return CHIP_STATUS_ABNORMAL;
    }
	delay_1us(10);

	#if (DEFAULT_CCA_USE_FLAG == CC1101_CCA_ENABLED)
		RfidStrobe(CC1101_SFTX);//Flush the TX FIFO buffer
		delay_1us(10);     
	#endif	                       
	vu32GDO0IntFlag = 0;
	// 如果数据包长度发生变化，重新写入包长度寄存器
	//if((u8LastLen != u8Length) && u8Length)
	//{
		RfidWriteReg(CC1101_PKTLEN,u8Length);
	//	u8LastLen = u8Length;
		delay_1us(40);
	//}
	// 往TX FIFO中写入数据，只有在空闲状态才可以
    RfidWriteFifo(pu8Data, u8Length+1);
	
	#if (DEFAULT_CCA_USE_FLAG != CC1101_CCA_ENABLED)
		delay_1us(10);
	#endif
	
#ifdef PAC_PORT
	//使能高功率发射
	gpio_bit_set(PAC_PORT, PAC_PIN);
#endif

	#if (DEFAULT_CCA_USE_FLAG == CC1101_CCA_ENABLED)
		RfidStrobe(CC1101_SRX);
		u16TimeoutCnt = 0x00;
		while(u16TimeoutCnt <= 250)
		{			
			u8ChipStatus = RfidReadStatusReg(CC1101_MARCSTATE);
			if(u8ChipStatus == CC1101_MARCSTATE_RX)
			{
				break;
			}
			u16TimeoutCnt++;
			delay_1us(1);
		}
		if(u16TimeoutCnt == 251)
		{
//			OS_EXIT_CRITICAL();//开全局中断
			return(CHIP_STATUS_ABNORMAL);
		}		
		
		u16TimeoutCnt = 0x00;
		while(u16TimeoutCnt <= 10)
		{
			// 开启CC1101的发送状态	
			RfidStrobe(CC1101_STX);	
			u8ChipStatus = RfidReadStatusReg(CC1101_MARCSTATE);
			if(u8ChipStatus == CC1101_MARCSTATE_TX)	
			{
				break;
			}
//			if(u8ChipStatus == CC1101_MARCSTATE_TXFIFO_UNDERFLOW)	
//				RfidStrobe(CC1101_SFTX);
			u16TimeoutCnt++;
			delay_1us(1);	
		}
		delay_1us(10);		
//		OS_EXIT_CRITICAL();//开全局中断
		
		// 判断一包数据是否发送完成
		u32i = 0;
		while(u32i++<0x20000)
		{
			if(vu32GDO0IntFlag)
			{
				vu32GDO0IntFlag = 0;
				delay_1us(10);
				break;
			}
		}
		RfidStrobe(CC1101_SFTX);
		if (u32i<0x20000)
		{
			return TX_OK;
		}
	#else
		// 开启CC1101的发送状态
	    RfidStrobe(CC1101_STX);
		delay_1us(10);

		OS_EXIT_CRITICAL();//开全局中断	
		// 判断一包数据是否发送完成
		u32i = 0;
		while(u32i++<0x20000)
		{
			if(vu32GDO0IntFlag)
			{
				vu32GDO0IntFlag = 0;
				delay_1us(10);
				break;
			}
		}
		RfidStrobe(CC1101_SFTX);
		if (u32i<0x20000)
		{
			return TX_OK;
		}	
	#endif

	return(TIME_OVER);
}
/***********************************************************************************************
** 函 数 名：	RfidReadFifoProc
** 功能描述：	读CC1101 FIFO，获取一个完整的数据包
** 输　  入：	uint8_t *pu8Data，传入保存接收数据的地址；
** 				uint8_t *pu8Length，传入保存接收数据长度的地址；
** 输　  出：	return 	RX_CRC_MISMATCH，表示CRC校验不正确；
**						RX_OK,表示接收数据成功
**						注意，接收的数据会保存在相应的缓存，以及数据长度；*pu8Length = 数据内容 + 1(*pu8Length本身占用一个字节)
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RfidReadFifoProc(uint8_t *pu8Data, uint8_t *pu8Length)
{
#if 1
    uint8_t u8DataLen;
// 	uint8_t u8CurrentRxBytes, u8LastRxBytes,u8LastDataLen;
    uint8_t u8AppendStatus[2];
	delay_1us(1);
	//读取数据
	RfidReadFifo(&u8DataLen, 1);				// 读取数据包长度字节
	delay_1us(1);
	RfidReadFifo(pu8Data, u8DataLen);			// 读取数据内容	
	delay_1us(1);
	//*pu8Length = u8DataLen;					// 返回数据长度	
	RfidReadFifo(u8AppendStatus, 2);			// CRC校验
	delay_1us(1);
	
	pu8Data[u8DataLen] = u8AppendStatus[0];
	pu8Data[u8DataLen + 1] = u8AppendStatus[1];
	
	*pu8Length = u8DataLen + 2;					// 返回数据长度
	// 清空这包数据，也就是清空接收缓存，只有在SIDLE、SRX（溢出时）才能
	//delay_1us(50);
	RfidStrobe(CC1101_SIDLE);
	delay_1us(1);
	RfidStrobe(CC1101_SFRX);
	delay_1us(1);
	SetRxMode();
	
	// 判断CRC校验是否正确，不正确返回RX_CRC_MISMATCH;否则返回RX_OK;
    if ((u8AppendStatus[1] & CC1101_LQI_CRC_OK_BM) != CC1101_LQI_CRC_OK_BM)
    {
        return(RX_CRC_MISMATCH);
    }
    return(RX_OK);
#endif // 0
}
/***********************************************************************************************
** 函 数 名：	RfidGetTxStatus
** 功能描述：	This function transmits a No Operation Strobe (SNOP) to get the status of
**				the radio and the number of free bytes in the TX FIFO
**				状态字节：
**      		---------------------------------------------------------------------------
**      		|          |            |                                                 |
**      		| CHIP_RDY | STATE[2:0] | FIFO_BYTES_AVAILABLE (free bytes in the TX FIFO |
**      		|          |            |                                                 |
**      		---------------------------------------------------------------------------				
** 输　  入：	
** 输　  出：	
** 注意事项：	当无线硬件正在更新寄存器的时候，同时我们通过SPI接口读取状态寄存器，将会有一个非常小的，
**				有限的可能导致结果是不正确的。同样的情况也存在芯片状态字节。CC1100和CC2500错误纠正中
**				解释了这个问题，并提供了几种工作区
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint8_t RfidGetTxStatus(void)
{
    return(RfidStrobe(CC1101_SNOP));
}

//---------------------------------------------------------------------------------------------
//---			CC1101休眠相关操作
//---------------------------------------------------------------------------------------------
/***********************************************************************************************
** 函 数 名：	SetRFChipSleep
** 功能描述：	设置射频芯片休眠
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void SetRFChipSleep(void)
{
	
    RfidRxRegInit();
	//delay_1us(10);
    /*
     * 当CSn拉高时，进入睡眠模式，即关闭电源模式
     */
    RfidStrobe(CC1101_SPWD);
	//delay_1us(10);
}
/***********************************************************************************************
** 函 数 名：	SetRFChipWOR
** 功能描述：	设置射频芯片WOR
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void SetRFChipWOR(void)
{
    RfidWORRegInit();
	
