gwyghy/wireless/WirelessModule/WirelessModule_GD32F1x0__boot/WirelessModule_APP/Project/rfid_cc1101.c
    /*
	 * 经过入口操作，进入定时唤醒接收状态
	 */
    RfidStrobe(CC1101_SWORRST);    			// Reset real time clock.
	//delay_1us(10);
    RfidStrobe(CC1101_SWOR);    			// Start automatic RX polling sequence (Wake-on-Radio).
	//delay_1us(10);
}
/***********************************************************************************************
** 函 数 名：	SetRFChipSleepMode
** 功能描述：	设置射频芯片睡眠模式
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void SetRFChipSleepMode(void)
{
    uint16_t u16CCR;
	
    /*根据实际情况设置CC1101工作状态*/
    if(g_u16RunningMode == OBUMODE_SLEEP)
    {
        SetRFChipSleep();
		//delay_1us(10);
		if (st_RFChipPar.u8ResIntervalTime < 3)
		{
			u16CCR = 125;				/*100ms*//* WOR_TIMER_CLK */
		}
		else
		{
			 /*目前最大52s，如需增大设置ACLK分频即可*/
			u16CCR = st_RFChipPar.u8ResIntervalTime * 1250;/* WOR_TIMER_CLK */
		}
		//WORTimerStart(u16CCR);
    }
    else
    {
        SetRFChipWOR();
		//delay_1us(10);
		//g_wRunningMode = OBUMODE_SLEEP;
    }
}
/***********************************************************************************************
** 函 数 名：	ClrRxFifo
** 功能描述：	清除接收缓存
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void ClrRxFifo(void)
{	
    RfidStrobe(CC1101_SFRX);		//进入接收状态
	delay_1us(1);
}
/***********************************************************************************************
** 函 数 名：	SetRxMode
** 功能描述：	EXTI INTERRUPT 服务子函数
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
void SetRxMode(void)
{	
	uint32_t	i;
	#if OS_CRITICAL_METHOD == 3                 /* Allocate storage for CPU status register           */
	OS_CPU_SR  cpu_sr = 0;
	#endif

//	OS_ENTER_CRITICAL();//关全局中断

#ifdef PAC_PORT
	//关闭高功率发射
	gpio_bit_reset(PAC_PORT, PAC_PIN);
#endif
	
	RfidRxRegInit();
	for (i = 0;i < 20;)
		i++;
    RfidStrobe(CC1101_SRX);		//进入接收状态	
	i = RfidReadStatusReg(CC1101_MARCSTATE);
	for (i = 0;i < 20;)
		i++;
//	OS_EXIT_CRITICAL();//开全局中断
}

/***********************************************************************************************
** 函 数 名：	RFID_GetFrame
** 功能描述：	从接收缓存中取出一个数据包
** 输　  入：	
** 输　  出：	
** 作　  者：	沈万江
** 日　  期：	2014.12.26
** 版    本：	V1.0.0
** 更新记录：
** 更新记录：
** 					日    期      姓    名                    描      述
** 					==========  =============  ========================================
**
************************************************************************************************/
uint32_t RFID_GetFrame(st_RFIDRcvFrame *RfidRcvFrm)
{
	if(u32RcvFrmPoolCnt)
	{
		#if OS_CRITICAL_METHOD == 3                      /* Allocate storage for CPU status register           */
		OS_CPU_SR  cpu_sr = 0;
		#endif

//		OS_ENTER_CRITICAL();//关全局中断
		*RfidRcvFrm = st_RFIDRcvFrmPool[u32RcvFrmPoolReadPtr++];
		u32RcvFrmPoolReadPtr %= RFID_RCV_FRM_SIZE;
		
		u32RcvFrmPoolCnt--;
//		OS_EXIT_CRITICAL();//开全局中断
		return RET_OK;
	}else
	{
		return RET_ERR;
	}
}
//---------------------------------------------------------------------------------------------
//---			EXTI 服务子函数
//---------------------------------------------------------------------------------------------

#if WL_SPI_TYPE == 1	//无线模块接口使用USART模拟SPI
/***********************************************************************************************
** 函 数 名：	EXTI0_IRQHandler
** 功能描述：	EXTI INTERRUPT 服务子函数
** 输　  入：	
** 输　  出：	
************************************************************************************************/
void EXTI0_1_IRQHandler(void)
{
	/* Get the status of RFID_GDO0_EXTI_LINE */
	if (exti_interrupt_flag_get(GPIO_PIN_1) != RESET)
	{
		/* Clear the RFID_GDO0_EXTI_LINE pending flag */
		exti_interrupt_flag_clear(GPIO_PIN_1);
		if (vu32CC1100State == 1)
		{

#ifdef PAC_PORT
			//关闭高功率发射
			gpio_bit_reset(PAC_PORT, PAC_PIN);
#endif

			vu32GDO0IntFlag = 1;
			vu32CC1100State = 2;			//发送完毕自动转入接收状态（寄存器设置）
		}
		else if (vu32CC1100State == 2)
		{
			uint8_t u8CurrentRxBytes;
			u8CurrentRxBytes = RfidReadStatusReg(CC1101_RXBYTES);
			// 如果发生溢出，则可以清空接收缓存
			if(u8CurrentRxBytes & 0x80)
			{
				RfidStrobe(CC1101_SFRX);	//清除接收缓冲区
				RfidStrobe(CC1101_SRX);		//进入接收状态	
			}
		}
	}
}
/***********************************************************************************************
** 函 数 名：	EXTI3_IRQHandler
** 功能描述：	EXTI INTERRUPT 服务子函数
** 输　  入：	
** 输　  出：	
************************************************************************************************/
void EXTI4_15_IRQHandler(void)
{
	uint32_t u32i;
	st_RFIDRcvFrame RfidRcvFrmTmp;
	/* Get the status of RFID_GDO2_EXTI_LINE */
	if (exti_interrupt_flag_get(GPIO_PIN_4) != RESET)
	{
		/* Clear the RFID_GDO2_EXTI_LINE pending flag */
		exti_interrupt_flag_clear(GPIO_PIN_4);

		//关全局中断？
		//OS_ENTER_CRITICAL();
		u32i = RfidReadFifoProc(u8RcvData, &u8RcvLength);
		//开全局中断？
		//OS_EXIT_CRITICAL();
			
		if (u32i == RX_OK)
		{
#if (CC1101_ADDR_FILTER > 0)
			if (u8RcvLength > 3)
			{
				RfidRcvFrmTmp.u8DataLen = u8RcvLength - 3;		// u8RcvLength = 1地址字节 + N数据字节 + 2个状态字节
				RfidRcvFrmTmp.u8DestAddr = u8RcvData[0];
				for(u32i = 0;u32i < RfidRcvFrmTmp.u8DataLen && u32i < 64;u32i++)
				{
					RfidRcvFrmTmp.u8Data[u32i] = u8RcvData[u32i + 1];
				}
#else
			if (u8RcvLength > 2)
			{
				RfidRcvFrmTmp.u8DataLen = u8RcvLength - 2;		// u8RcvLength = N数据字节 + 2个状态字节
				RfidRcvFrmTmp.u8DestAddr = 0x00;
				for(u32i = 0;u32i < RfidRcvFrmTmp.u8DataLen && u32i < 64;u32i++)
				{
					RfidRcvFrmTmp.u8Data[u32i] = u8RcvData[u32i];
				}
#endif	
				RfidRcvFrmTmp.u8AppendStatus[0] = u8RcvData[u8RcvLength-2];
				RfidRcvFrmTmp.u8AppendStatus[1] = u8RcvData[u8RcvLength-1];
			
				if (u32RcvFrmPoolCnt < RFID_RCV_FRM_SIZE)
				{
					// 将数据包插入到缓存池中
					st_RFIDRcvFrmPool[u32RcvFrmPoolWritePtr++] = RfidRcvFrmTmp;
					u32RcvFrmPoolWritePtr %= RFID_RCV_FRM_SIZE;
					
					u32RcvFrmPoolCnt++;
					// 接收到数据后的回调函数
//					OSSemPost(RfidRxSem);	//RFID接收到数据
//					if (RcvedBackCallFunc != NULL)
//						(*RcvedBackCallFunc)();
					Wl_RxDataProc();
				}
			}
		}
	}
}
#endif

#endif	//#if WL_SPI_TYPE > 0
/*********************************天津华宁电子有限公司*************************************************************/
